## Agregación de Datos por categoría

In [1]:
import numpy as np
import pandas as pd

In [3]:
gender = ["Male", "Female"]
income = ["Poor", "Middle Class", "Rich"]

In [4]:
n = 500
gender_data = []
income_data = []

for i in range(500):
    gender_data.append(np.random.choice(gender))
    income_data.append(np.random.choice(income))

In [7]:
gender_data[:10]

['Male',
 'Male',
 'Male',
 'Female',
 'Male',
 'Female',
 'Male',
 'Female',
 'Female',
 'Male']

In [8]:
income_data[:10]

['Rich',
 'Rich',
 'Poor',
 'Poor',
 'Middle Class',
 'Poor',
 'Poor',
 'Poor',
 'Poor',
 'Middle Class']

In [42]:
height = 160 + 30 * np.random.randn(n)
weight = 65 + 25 * np.random.randn(n)
age = 30 + 12 * np.random.randn(n)
income = 18000 + 3500 * np.random.randn(n)

In [43]:
data = pd.DataFrame(
    {
        "Gender": gender_data,
        "Economic Status": income_data,
        "Height": height,
        "Age" : age,
        "Income" : income,
        "Weight": weight
    }
)

In [44]:
data.head()

   Gender Economic Status      Height        Age        Income     Weight
0    Male            Rich  192.291127  32.155617  19699.087555  35.336159
1    Male            Rich  172.774157  27.152088  23295.167002  64.017634
2    Male            Poor  192.480497  14.909088  16883.475948  93.237844
3  Female            Poor  158.358985  23.774270  23780.298496  49.244861
4    Male    Middle Class  192.354158  19.752495  22051.806587  50.081838

## Agrupación de datos

In [45]:
grouped_gender = data.groupby("Gender")

In [46]:
grouped_gender.groups

{'Female': [3, 5, 7, 8, 10, 12, 13, 14, 16, 20, 23, 25, 27, 28, 31, 33, 37, 38, 39, 42, 45, 46, 48, 50, 59, 60, 63, 65, 67, 69, 70, 71, 72, 73, 75, 77, 78, 79, 80, 81, 83, 84, 86, 93, 95, 97, 104, 105, 106, 107, 111, 112, 114, 115, 118, 121, 122, 125, 127, 129, 130, 131, 132, 133, 134, 137, 138, 140, 141, 142, 146, 147, 149, 151, 152, 153, 155, 158, 160, 162, 163, 164, 165, 166, 167, 169, 172, 173, 174, 180, 182, 183, 184, 186, 187, 188, 190, 191, 192, 194, ...], 'Male': [0, 1, 2, 4, 6, 9, 11, 15, 17, 18, 19, 21, 22, 24, 26, 29, 30, 32, 34, 35, 36, 40, 41, 43, 44, 47, 49, 51, 52, 53, 54, 55, 56, 57, 58, 61, 62, 64, 66, 68, 74, 76, 82, 85, 87, 88, 89, 90, 91, 92, 94, 96, 98, 99, 100, 101, 102, 103, 108, 109, 110, 113, 116, 117, 119, 120, 123, 124, 126, 128, 135, 136, 139, 143, 144, 145, 148, 150, 154, 156, 157, 159, 161, 168, 170, 171, 175, 176, 177, 178, 179, 181, 185, 189, 193, 195, 198, 199, 200, 201, ...]}

In [47]:
for names, groups in grouped_gender:
    print(names)
    print(groups)

Female
     Gender Economic Status      Height        Age        Income      Weight
3    Female            Poor  158.358985  23.774270  23780.298496   49.244861
5    Female            Poor  161.944390  27.974545  15288.774618   46.118407
7    Female            Poor  144.859457  39.438182  16119.772326   43.043447
8    Female            Poor  155.806934  28.486180  14637.647293   37.479192
10   Female            Rich  129.231600  16.041174  13429.867381   49.887975
..      ...             ...         ...        ...           ...         ...
483  Female            Rich  123.699726  49.346813  21730.364328   91.702112
484  Female            Poor  108.979704  29.623132  15627.466254  106.611562
489  Female            Rich  181.554136  -2.979634  15207.284921   87.040851
495  Female    Middle Class   96.233259   7.965505  15851.286929   35.553501
499  Female    Middle Class  180.904146  57.667559  13929.649026   37.806586

[254 rows x 6 columns]
Male
    Gender Economic Status      Height        Age        Income      Weight
0     Male            Rich  192.291127  32.155617  19699.087555   35.336159
1     Male            Rich  172.774157  27.152088  23295.167002   64.017634
2     Male            Poor  192.480497  14.909088  16883.475948   93.237844
4     Male    Middle Class  192.354158  19.752495  22051.806587   50.081838
6     Male            Poor  159.380768  51.420456  24680.749784   89.892495
..     ...             ...         ...        ...           ...         ...
493   Male    Middle Class  183.034969  12.301334  18153.644574   87.609164
494   Male            Poor  147.095003   8.965279  15762.096056   70.687512
496   Male            Poor  167.662509  46.821846  19657.415649   41.551674
497   Male            Poor  177.652725  14.558505  17384.443703  110.367410
498   Male            Rich  161.081168  37.266966  15240.575746   41.165775

[246 rows x 6 columns]

In [48]:
grouped_gender.get_group("Male")

    Gender Economic Status      Height        Age        Income      Weight
0     Male            Rich  192.291127  32.155617  19699.087555   35.336159
1     Male            Rich  172.774157  27.152088  23295.167002   64.017634
2     Male            Poor  192.480497  14.909088  16883.475948   93.237844
4     Male    Middle Class  192.354158  19.752495  22051.806587   50.081838
6     Male            Poor  159.380768  51.420456  24680.749784   89.892495
..     ...             ...         ...        ...           ...         ...
493   Male    Middle Class  183.034969  12.301334  18153.644574   87.609164
494   Male            Poor  147.095003   8.965279  15762.096056   70.687512
496   Male            Poor  167.662509  46.821846  19657.415649   41.551674
497   Male            Poor  177.652725  14.558505  17384.443703  110.367410
498   Male            Rich  161.081168  37.266966  15240.575746   41.165775

[246 rows x 6 columns]

In [49]:
grouped_gender.get_group("Female")

     Gender Economic Status      Height        Age        Income      Weight
3    Female            Poor  158.358985  23.774270  23780.298496   49.244861
5    Female            Poor  161.944390  27.974545  15288.774618   46.118407
7    Female            Poor  144.859457  39.438182  16119.772326   43.043447
8    Female            Poor  155.806934  28.486180  14637.647293   37.479192
10   Female            Rich  129.231600  16.041174  13429.867381   49.887975
..      ...             ...         ...        ...           ...         ...
483  Female            Rich  123.699726  49.346813  21730.364328   91.702112
484  Female            Poor  108.979704  29.623132  15627.466254  106.611562
489  Female            Rich  181.554136  -2.979634  15207.284921   87.040851
495  Female    Middle Class   96.233259   7.965505  15851.286929   35.553501
499  Female    Middle Class  180.904146  57.667559  13929.649026   37.806586

[254 rows x 6 columns]

In [50]:
double_group = data.groupby(["Gender", "Economic Status"])

In [51]:
len(double_group)

6

In [52]:
for names, groups in double_group:
    print(names)
    print(groups)

('Female', 'Middle Class')
     Gender Economic Status      Height        Age        Income     Weight
27   Female    Middle Class  158.090759  41.608839  22120.510751  60.323716
28   Female    Middle Class  170.563363  25.241121  14445.888902  88.877036
31   Female    Middle Class  179.880295  25.090038  21390.479388  52.333389
33   Female    Middle Class  198.574617  30.671826  18937.892355  50.668687
39   Female    Middle Class  136.893447  44.749303  19354.045831  75.325904
..      ...             ...         ...        ...           ...        ...
462  Female    Middle Class  177.435832  33.990637  18732.663036  44.894276
472  Female    Middle Class  121.837666  43.131766  10225.561634  66.469008
475  Female    Middle Class  154.394495  25.963085  22009.636749  62.514346
495  Female    Middle Class   96.233259   7.965505  15851.286929  35.553501
499  Female    Middle Class  180.904146  57.667559  13929.649026  37.806586

[76 rows x 6 columns]
('Female', 'Poor')
     Gender Economic Status      Height        Age        Income      Weight
3    Female            Poor  158.358985  23.774270  23780.298496   49.244861
5    Female            Poor  161.944390  27.974545  15288.774618   46.118407
7    Female            Poor  144.859457  39.438182  16119.772326   43.043447
8    Female            Poor  155.806934  28.486180  14637.647293   37.479192
12   Female            Poor  174.957812  35.731809  17091.155330   72.333387
..      ...             ...         ...        ...           ...         ...
445  Female            Poor  170.210680   8.521578  19884.954583   77.284402
447  Female            Poor  148.540276  28.091721  19965.238692   86.154568
454  Female            Poor  103.397423  42.070008  10198.836317   51.558526
478  Female            Poor  186.275780  45.111458  17474.403073   68.799126
484  Female            Poor  108.979704  29.623132  15627.466254  106.611562

[78 rows x 6 columns]
('Female', 'Rich')
     Gender Economic Status      Height        Age        Income     Weight
10   Female            Rich  129.231600  16.041174  13429.867381  49.887975
13   Female            Rich  158.498806  20.854983  20794.864081  10.397792
16   Female            Rich  179.533656  39.813839  16905.377624  19.122580
23   Female            Rich  133.170390  36.615566  11782.839323  92.443713
25   Female            Rich  187.307730  16.365985  15556.805698  25.588737
..      ...             ...         ...        ...           ...        ...
468  Female            Rich  163.208663  50.056475  24862.725119  51.055038
470  Female            Rich  147.455234  14.501713  17162.452457  25.395094
481  Female            Rich  155.341180  34.723532  17128.694290  -4.747473
483  Female            Rich  123.699726  49.346813  21730.364328  91.702112
489  Female            Rich  181.554136  -2.979634  15207.284921  87.040851

[100 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height        Age        Income     Weight
4     Male    Middle Class  192.354158  19.752495  22051.806587  50.081838
9     Male    Middle Class  151.600138  38.521415  17404.227295  87.802266
15    Male    Middle Class  193.566514  40.788178  18557.783536  84.385636
19    Male    Middle Class  130.481512  35.665315  20943.365042  68.815268
24    Male    Middle Class  181.743678  42.955818  20815.838390  58.766697
..     ...             ...         ...        ...           ...        ...
474   Male    Middle Class  153.129046  18.558962  15254.698306  71.086762
477   Male    Middle Class  153.543258  41.201188  17529.724382  18.778831
480   Male    Middle Class  209.162827  44.422913  19216.515899  80.273793
492   Male    Middle Class  153.469229  21.498796  14685.473678   5.512412
493   Male    Middle Class  183.034969  12.301334  18153.644574  87.609164

[76 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status      Height        Age        Income      Weight
2     Male            Poor  192.480497  14.909088  16883.475948   93.237844
6     Male            Poor  159.380768  51.420456  24680.749784   89.892495
18    Male            Poor  204.277116  18.342247   9318.612263   74.987478
21    Male            Poor  161.836389  40.636237  15649.025152   91.167703
26    Male            Poor  126.815644  32.797114  17260.486225   67.334005
..     ...             ...         ...        ...           ...         ...
486   Male            Poor  152.502418  37.922546  17096.438176   75.612629
487   Male            Poor  203.662992  24.532562  24703.302098   97.701409
494   Male            Poor  147.095003   8.965279  15762.096056   70.687512
496   Male            Poor  167.662509  46.821846  19657.415649   41.551674
497   Male            Poor  177.652725  14.558505  17384.443703  110.367410

[92 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status      Height        Age        Income     Weight
0     Male            Rich  192.291127  32.155617  19699.087555  35.336159
1     Male            Rich  172.774157  27.152088  23295.167002  64.017634
11    Male            Rich  155.068724  19.108014  19026.149830  69.688989
17    Male            Rich  144.089422  33.818752  20793.286287  41.365037
22    Male            Rich  144.838849  30.026520  17509.375888  41.828821
..     ...             ...         ...        ...           ...        ...
485   Male            Rich  180.737948  35.142318  19949.869578  52.803027
488   Male            Rich  176.126643  28.564784  20612.230268  72.369308
490   Male            Rich  135.036785  23.193275  16529.290028  37.304430
491   Male            Rich  178.820537  36.768720  21676.575605  29.678140
498   Male            Rich  161.081168  37.266966  15240.575746  41.165775

[78 rows x 6 columns]

## Operaciones sobre datos agrupados

In [53]:
double_group.sum()

                              Height          Age        Income       Weight
Gender Economic Status
Female Middle Class     11876.842657  2272.691961  1.381136e+06  4844.579750
       Poor             12617.141643  2424.308099  1.407324e+06  4745.367411
       Rich             15886.812851  3051.628259  1.817418e+06  6557.453788
Male   Middle Class     11939.972886  2340.606711  1.410487e+06  4809.563805
       Poor             14889.127127  2736.108569  1.672806e+06  6389.695438
       Rich             12910.128492  2375.904611  1.383416e+06  5149.049637

In [54]:
double_group.mean()

                            Height        Age        Income     Weight
Gender Economic Status
Female Middle Class     156.274245  29.903842  18172.836043  63.744470
       Poor             161.758226  31.080873  18042.619689  60.838044
       Rich             158.868129  30.516283  18174.183558  65.574538
Male   Middle Class     157.104906  30.797457  18559.044271  63.283734
       Poor             161.838338  29.740311  18182.674577  69.453211
       Rich             165.514468  30.460316  17736.101806  66.013457

In [55]:
double_group.size()

Gender  Economic Status
Female  Middle Class        76
        Poor                78
        Rich               100
Male    Middle Class        76
        Poor                92
        Rich                78
dtype: int64

In [56]:
double_group.describe()

                       Height                                                 \
                        count        mean        std         min         25%
Gender Economic Status
Female Middle Class      76.0  156.274245  34.556670   85.215459  133.986197
       Poor              78.0  161.758226  27.399627   93.605274  147.143552
       Rich             100.0  158.868129  30.280039   91.547959  131.933790
Male   Middle Class      76.0  157.104906  31.484843   76.562503  134.418985
       Poor              92.0  161.838338  29.172986   79.660005  145.748411
       Rich              78.0  165.514468  26.344786  115.421103  146.889354

                                                              Age             \
                               50%         75%         max  count       mean
Gender Economic Status
Female Middle Class     158.441506  178.127882  239.809964   76.0  29.903842
       Poor             158.508119  179.309150  241.627281   78.0  31.080873
       Rich             162.119471  181.616195  227.500915  100.0  30.516283
Male   Middle Class     156.387217  180.206617  223.463477   76.0  30.797457
       Poor             160.763308  180.336483  237.044168   92.0  29.740311
       Rich             160.915960  180.293817  243.184773   78.0  30.460316

                        ...        Income               Weight             \
                        ...           75%           max  count       mean
Gender Economic Status  ...
Female Middle Class     ...  20636.841421  27346.685008   76.0  63.744470
       Poor             ...  20283.772203  28642.236058   78.0  60.838044
       Rich             ...  20746.317495  29294.992193  100.0  65.574538
Male   Middle Class     ...  20840.494178  25059.393027   76.0  63.283734
       Poor             ...  20286.585057  24703.302098   92.0  69.453211
       Rich             ...  19908.830455  26324.936058   78.0  66.013457

                                                                               \
                              std        min        25%        50%        75%
Gender Economic Status
Female Middle Class     22.714485   5.619332  47.985793  60.779491  80.376615
       Poor             21.910332  -5.250577  45.836916  61.800462  74.249940
       Rich             25.507513  -4.747473  50.850611  65.445401  83.826515
Male   Middle Class     27.453096   5.512412  44.970740  65.389576  80.948144
       Poor             23.380087   7.858608  53.479861  71.079247  88.087700
       Rich             29.147962 -31.205954  46.566810  69.643460  86.012115


                               max
Gender Economic Status
Female Middle Class     131.853045
       Poor             109.575426
       Rich             119.904214
Male   Middle Class     138.272852
       Poor             112.480756
       Rich             148.611588

[6 rows x 32 columns]

In [57]:
grouped_income = double_group["Income"]

In [58]:
grouped_income

In [59]:
for names, groups in grouped_income:
    print(names)
    print(groups)

('Female', 'Middle Class')
27     22120.510751
28     14445.888902
31     21390.479388
33     18937.892355
39     19354.045831
           ...
462    18732.663036
472    10225.561634
475    22009.636749
495    15851.286929
499    13929.649026
Name: Income, Length: 76, dtype: float64
('Female', 'Poor')
3      23780.298496
5      15288.774618
7      16119.772326
8      14637.647293
12     17091.155330
           ...
445    19884.954583
447    19965.238692
454    10198.836317
478    17474.403073
484    15627.466254
Name: Income, Length: 78, dtype: float64
('Female', 'Rich')
10     13429.867381
13     20794.864081
16     16905.377624
23     11782.839323
25     15556.805698
           ...
468    24862.725119
470    17162.452457
481    17128.694290
483    21730.364328
489    15207.284921
Name: Income, Length: 100, dtype: float64
('Male', 'Middle Class')
4      22051.806587
9      17404.227295
15     18557.783536
19     20943.365042
24     20815.838390
           ...
474    15254.698306
477    17529.724382
480    19216.515899
492    14685.473678
493    18153.644574
Name: Income, Length: 76, dtype: float64
('Male', 'Poor')
2      16883.475948
6      24680.749784
18      9318.612263
21     15649.025152
26     17260.486225
           ...
486    17096.438176
487    24703.302098
494    15762.096056
496    19657.415649
497    17384.443703
Name: Income, Length: 92, dtype: float64
('Male', 'Rich')
0      19699.087555
1      23295.167002
11     19026.149830
17     20793.286287
22     17509.375888
           ...
485    19949.869578
488    20612.230268
490    16529.290028
491    21676.575605
498    15240.575746
Name: Income, Length: 78, dtype: float64

In [60]:
grouped_income.describe()

                        count          mean          std           min  \
Gender Economic Status
Female Middle Class      76.0  18172.836043  3682.530623  10225.561634
       Poor              78.0  18042.619689  3492.476642   8121.983364
       Rich             100.0  18174.183558  3434.097891  10515.392681
Male   Middle Class      76.0  18559.044271  3200.479825  10212.421030
       Poor              92.0  18182.674577  3426.823024   9318.612263
       Rich              78.0  17736.101806  3198.611442  10242.926762

                                 25%           50%           75%           max
Gender Economic Status
Female Middle Class     15198.314987  18553.630830  20636.841421  27346.685008
       Poor             15557.937743  18382.800223  20283.772203  28642.236058
       Rich             15998.826587  18233.766642  20746.317495  29294.992193
Male   Middle Class     16389.747562  18571.700875  20840.494178  25059.393027
       Poor             15733.828330  18673.593455  20286.585057  24703.302098
       Rich             15609.852739  17833.498923  19908.830455  26324.936058

In [64]:
double_group.aggregate(
    {
        "Income": "sum",
        "Age": "mean",
        "Height": "std"
    }
)

                              Income        Age     Height
Gender Economic Status
Female Middle Class     1.381136e+06  29.903842  34.556670
       Poor             1.407324e+06  31.080873  27.399627
       Rich             1.817418e+06  30.516283  30.280039
Male   Middle Class     1.410487e+06  30.797457  31.484843
       Poor             1.672806e+06  29.740311  29.172986
       Rich             1.383416e+06  30.460316  26.344786

In [65]:
double_group.aggregate(
    {
        "Age": "mean",
        "Height": lambda h: np.mean(h)/np.std(h)
    }
)

                              Age    Height
Gender Economic Status
Female Middle Class     29.903842  4.552309
       Poor             31.080873  5.941877
       Rich             30.516283  5.273061
Male   Middle Class     30.797457  5.023014
       Poor             29.740311  5.577939
       Rich             30.460316  6.323292

In [66]:
double_group.aggregate( ["sum", "mean", "std"]
)

                              Height                                 Age  \
                                 sum        mean        std          sum
Gender Economic Status
Female Middle Class     11876.842657  156.274245  34.556670  2272.691961
       Poor             12617.141643  161.758226  27.399627  2424.308099
       Rich             15886.812851  158.868129  30.280039  3051.628259
Male   Middle Class     11939.972886  157.104906  31.484843  2340.606711
       Poor             14889.127127  161.838338  29.172986  2736.108569
       Rich             12910.128492  165.514468  26.344786  2375.904611

                                                    Income                \
                             mean        std           sum          mean
Gender Economic Status
Female Middle Class     29.903842  11.359855  1.381136e+06  18172.836043
       Poor             31.080873  12.092106  1.407324e+06  18042.619689
       Rich             30.516283  11.994919  1.817418e+06  18174.183558
Male   Middle Class     30.797457  12.906729  1.410487e+06  18559.044271
       Poor             29.740311  11.692637  1.672806e+06  18182.674577
       Rich             30.460316  10.049948  1.383416e+06  17736.101806

                                          Weight
                                std          sum       mean        std
Gender Economic Status
Female Middle Class     3682.530623  4844.579750  63.744470  22.714485
       Poor             3492.476642  4745.367411  60.838044  21.910332
       Rich             3434.097891  6557.453788  65.574538  25.507513
Male   Middle Class     3200.479825  4809.563805  63.283734  27.453096
       Poor             3426.823024  6389.695438  69.453211  23.380087
       Rich             3198.611442  5149.049637  66.013457  29.147962

In [67]:
double_group.aggregate( [lambda h: np.mean(h)/np.std(h)])

                          Height       Age    Income    Weight
                        <lambda>  <lambda>  <lambda>  <lambda>
Gender Economic Status
Female Middle Class     4.552309  2.649905  4.967667  2.824983
       Poor             5.941877  2.586981  5.199577  2.794655
       Rich             5.273061  2.556918  5.318934  2.583744
Male   Middle Class     5.023014  2.402010  5.837363  2.320475
       Poor             5.577939  2.557445  5.335060  2.986891
       Rich             6.323292  3.050511  5.580828  2.279430